In [1]:
#here using normal python dict for data
person = {
    
    "first":"pavan",
    "last": "singara"    
}

In [2]:
#here we use list in dict for saving set of values
person = {
    "first" : ["pavan","corey"],
    "last": ["sin","shafer"]    
}

In [3]:
#keys are columns,  values are rows
person['last']

['sin', 'shafer']

In [4]:
#using pandas are very efficient thn dict

import pandas as pd

In [5]:
df= pd. DataFrame(person)

In [6]:
df

   first    last
0  pavan     sin
1  corey  shafer

In [7]:
df['last']

0       sin
1    shafer
Name: last, dtype: object

In [8]:
type(df["last"])

pandas.core.series.Series

In [9]:
#series object is a list of data like df but more functionality. series is called series of rows but df is set of rows and col
# df is a set of series too thats why it gives seris objects

#use key value to get data rather dot notation data.last aslo gives same dat but still key is preferred. series a single colof rows


df[['first','last']] #list passed this is a df not a series causeb of multiple cols

   first    last
0  pavan     sin
1  corey  shafer

In [10]:
df.columns

Index(['first', 'last'], dtype='object')

In [11]:
df.iloc[0] # here starting index is set to cols names not 0 1 ...

first    pavan
last       sin
Name: 0, dtype: object

In [12]:
df.iloc[[0,1]] # a df we can pass two args nin loc

   first    last
0  pavan     sin
1  corey  shafer

In [13]:
df.iloc[[0,1], 1] #searchinig for int location -firrt rows then cols, loc uses label.iloc uses number

0       sin
1    shafer
Name: last, dtype: object

In [14]:
df.loc[[0,1], ['last']] #label

     last
0     sin
1  shafer

In [15]:
df

   first    last
0  pavan     sin
1  corey  shafer

In [16]:
import pandas as pd
df=pd.DataFrame(person)

In [17]:
person = {
    
    "first":"pavan",
    "last": "singara"    
}

In [18]:
import pandas as pd

In [19]:
df=pd.DataFrame(person)

ValueError: If using all scalar values, you must pass an index

In [5]:
import pandas as pd

person1 = {
    
    "first": ["pavan","dhoni"],
    "age": [ 20, 30],
    "aadhar": [ 121, 122],
    "email":["sms@gmail","jfn@gmail"]
}

In [6]:
import pandas as pd

In [7]:
df1=pd.DataFrame(person1)

In [8]:
df1

   first  age  aadhar      email
0  pavan   20     121  sms@gmail
1  dhoni   30     122  jfn@gmail

In [8]:
df1["aadhar"]

0    121
1    122
Name: aadhar, dtype: int64

In [8]:
df1.set_index("aadhar") # seting new indexes but it wont effect the original df

        first  age      email
aadhar
121     pavan   20  sms@gmail
122     dhoni   30  jfn@gmail

In [9]:
df1

   first  age  aadhar      email
0  pavan   20     121  sms@gmail
1  dhoni   30     122  jfn@gmail

In [ ]:
#we can do change index permanently by using inplace
df1.set_index("aadhar", inplace = True)

In [ ]:
df1 # see the below result

In [ ]:
df.index

In [ ]:
df1.index #index changed

In [ ]:
df1.iloc[1]

In [ ]:
df1.reset_index(inplace=True) #reset

In [ ]:
df1

In [ ]:
df1.loc[0]

In [ ]:
df1.set_index("aadhar",inplace=True)

In [ ]:
df1.index

In [ ]:
df1.index

In [ ]:
df1.loc[121]

In [ ]:
df1

In [ ]:
df1.reset_index()

In [10]:
df1['age'] == 20

0     True
1    False
Name: age, dtype: bool

In [11]:
r= (df1['age'] == 20)

In [12]:
df1[r] #use square brace whenever df is calling something

   first  age  aadhar      email
0  pavan   20     121  sms@gmail

In [13]:
df1.loc[r] #both gives same result

   first  age  aadhar      email
0  pavan   20     121  sms@gmail

In [ ]:
df1[df1['age']== 20] #filtering

In [ ]:
#conditionals

r = ((df1['age']== 20) & (df1['first']=='pavan'))

In [ ]:
r

In [ ]:
df1

In [ ]:
df1.reset_index()

In [ ]:
t = ((df1['age']== 20) & (df1['first']=='pavan'))

In [ ]:
t

df1

In [ ]:
df1

In [ ]:
df1.reset_index(inplace=True)

In [ ]:
df1

In [14]:
r = ((df1['age']== 20) & (df1['first']=='pavan'))

In [15]:
r

0     True
1    False
dtype: bool

In [16]:
df1.loc[r,'aadhar'] #GETTING AADHAR NUMBER FOR PAVAN

0    121
Name: aadhar, dtype: int64

In [17]:
#TILDE OPERTATOR FOR OPPOSITE RESULTS

df1.loc[~r, 'aadhar']

1    122
Name: aadhar, dtype: int64

In [20]:
df1

NameError: name 'df1' is not defined

In [25]:
df1

   first  age  aadhar
0  pavan   20     121
1  dhoni   30     122

In [26]:
df1.columns

Index(['first', 'age', 'aadhar'], dtype='object')

In [28]:
df1.columns=['first_name','age','aid']

In [29]:
df1

  first_name  age  aid
0      pavan   20  121
1      dhoni   30  122

In [30]:
df1.columns=[ x.upper() for x in df1.columns] #upper case

In [81]:
df1

   first  age  aadhar      email
0  pavan   20     121  sms@gmail
1  dhoni   30     122  jfn@gmail

In [32]:
df1.columns= df1.columns.str.replace('_',':') #replacing spaces etc...

In [33]:
df1

  FIRST:NAME  AGE  AID
0      pavan   20  121
1      dhoni   30  122

In [36]:
df1.rename(columns={'FIRST:NAME': 'FIRST'}, inplace= True) #for individual columns

In [37]:
df1

   FIRST  AGE  AID
0  pavan   20  121
1  dhoni   30  122

In [39]:
#updating values

df1.loc[1]=['msd','37','183']

In [40]:
df1

   FIRST AGE  AID
0  pavan  20  121
1    msd  37  183

In [47]:
#changing only aid

df1.loc[1,'AID'] = '224'

In [48]:
df1 #dont knpw why new col came into pic

   FIRST AGE  AID  aid
0  pavan  20  121  NaN
1    msd  37  224  224

In [49]:
df1.at[1,'AID']= 227 #for single value change we use at operator

In [50]:
df1

   FIRST AGE  AID  aid
0  pavan  20  121  NaN
1    msd  37  227  224

In [51]:
df1.loc[1,['FIRST','AID']]=['MAHI',183]

In [52]:
df1

   FIRST AGE  AID  aid
0  pavan  20  121  NaN
1   MAHI  37  183  224

In [53]:
df1.drop(aid)

NameError: name 'aid' is not defined

In [54]:
df1.drop['aid']

TypeError: 'method' object is not subscriptable

In [56]:
df1.drop(['aid'],axis=1)

   FIRST AGE  AID
0  pavan  20  121
1   MAHI  37  183

In [58]:
#apply ,map ,replACE

#APPLY WORK ON DF AND A SERIES

df1['AGE'].apply(len)

TypeError: object of type 'int' has no len()

In [59]:
df1['FIRST'].apply(len)

0    5
1    4
Name: FIRST, dtype: int64

In [60]:
df1

   FIRST AGE  AID  aid
0  pavan  20  121  NaN
1   MAHI  37  183  224

In [67]:
df1

   first  age  aadhar      email
0  pavan   20     121  sms@gmail
1  dhoni   30     122  jfn@gmail

In [68]:
def update(email):
    return email.upper()

In [69]:
df1

   first  age  aadhar      email
0  pavan   20     121  sms@gmail
1  dhoni   30     122  jfn@gmail

In [70]:
df1['email'].apply(update) #this did not change df

0    SMS@GMAIL
1    JFN@GMAIL
Name: email, dtype: object

In [71]:
df1

   first  age  aadhar      email
0  pavan   20     121  sms@gmail
1  dhoni   30     122  jfn@gmail

In [72]:
df1['email']=df1['email'].apply(update) #we have reassigned dfq1=df1 again to get the result in df

In [73]:
df1

   first  age  aadhar      email
0  pavan   20     121  SMS@GMAIL
1  dhoni   30     122  JFN@GMAIL

In [74]:
df1['email'].lower()

AttributeError: 'Series' object has no attribute 'lower'

In [79]:
# for a series we cant use upper lower directly so we wrte a func like we did above or lammbda function
df1['email'] = df1['email'].apply(lambda x: x.lower())

In [80]:
df1

   first  age  aadhar      email
0  pavan   20     121  sms@gmail
1  dhoni   30     122  jfn@gmail

In [82]:
df1['email'].apply(len)

0    9
1    9
Name: email, dtype: int64

In [83]:
#but apply for df wont work as it did for a series

#applymap used for dataframe

df1.applymap(len)

TypeError: object of type 'int' has no len()

In [84]:
df1.applymap(str.lower) # because we have integers in df

TypeError: descriptor 'lower' for 'str' objects doesn't apply to a 'int' object

In [85]:
df1.applymap(str)

   first age aadhar      email
0  pavan  20    121  sms@gmail
1  dhoni  30    122  jfn@gmail

In [86]:
type(df1
    )

pandas.core.frame.DataFrame

In [88]:
df1.apply(len)

first     2
age       2
aadhar    2
email     2
dtype: int64

In [89]:
#df['DataFrame Column'] = df['DataFrame Column'].astype(str)
df1['age']=df1['age'].astype(str)

In [90]:
print(df1.dtypes)# see age has changed to object from int

first     object
age       object
aadhar     int64
email     object
dtype: object

In [10]:
df1['first'].map({'pavan':'veer'}) #here we get nan if we did not give any value for no 1

0    veer
1     NaN
Name: first, dtype: object

In [11]:
df1['first'].replace({'veer':'pavan'}) #using replace we wont get nan

0    pavan
1    dhoni
Name: first, dtype: object

In [12]:
#again to make these reflecy in a df u need to assign df1=df1.replace like that
df1['first']=df1['first'].replace({'veer':'pavan'})

In [18]:
df1

   first  age  aadhar      email
0  pavan   20     121  sms@gmail
1  dhoni   30     122  jfn@gmail

In [19]:
df1['first'] +'' + df1['email'] #creating new col using strings

0    pavansms@gmail
1    dhonijfn@gmail
dtype: object

In [21]:
df1['new_col']= df1['first']+''+df1['email']

In [22]:
df1

   first  age  aadhar      email         new_col
0  pavan   20     121  sms@gmail  pavansms@gmail
1  dhoni   30     122  jfn@gmail  dhonijfn@gmail

In [23]:
#use brackets only not dot notation

df1.drop(columns ={'new_col'})

   first  age  aadhar      email
0  pavan   20     121  sms@gmail
1  dhoni   30     122  jfn@gmail

In [28]:
df1

   first  age  aadhar      email
0  pavan   20     121  sms@gmail
1  dhoni   30     122  jfn@gmail

In [27]:
#making in permannent use inplace
df1.drop(columns={'new_col'})

KeyError: "['new_col'] not found in axis"

In [29]:
df1['new_col']= df1['first']+''+df1['email']

In [30]:
df1

   first  age  aadhar      email         new_col
0  pavan   20     121  sms@gmail  pavansms@gmail
1  dhoni   30     122  jfn@gmail  dhonijfn@gmail

In [33]:
df1['new_col'].str.split('')

0    [, p, a, v, a, n, s, m, s, @, g, m, a, i, l, ]
1    [, d, h, o, n, i, j, f, n, @, g, m, a, i, l, ]
Name: new_col, dtype: object

In [37]:
df1['new_col'].str.split('',expand=True)

  0  1  2  3  4  5  6  7  8  9  10 11 12 13 14 15
0     p  a  v  a  n  s  m  s  @  g  m  a  i  l
1     d  h  o  n  i  j  f  n  @  g  m  a  i  l

In [39]:
df1.append({'first':'tony'}, ignore_index=True)

   first   age  aadhar      email         new_col
0  pavan  20.0   121.0  sms@gmail  pavansms@gmail
1  dhoni  30.0   122.0  jfn@gmail  dhonijfn@gmail
2   tony   NaN     NaN        NaN             NaN

In [1]:
import pandas as pd

people= {
    
    "name":['thor','hulk','captain'],
    "home":['asgard','lab','war']
    
}

In [2]:
df2=pd.DataFrame(people)

df2

In [4]:
df2

      name    home
0     thor  asgard
1     hulk     lab
2  captain     war

In [46]:
df1.append(df2)

   first   age  aadhar      email         new_col     name    home
0  pavan  20.0   121.0  sms@gmail  pavansms@gmail      NaN     NaN
1  dhoni  30.0   122.0  jfn@gmail  dhonijfn@gmail      NaN     NaN
0    NaN   NaN     NaN        NaN             NaN     thor  asgard
1    NaN   NaN     NaN        NaN             NaN     hulk     lab
2    NaN   NaN     NaN        NaN             NaN  captain     war

In [47]:
df1.append(df2, ignore_index=True)

   first   age  aadhar      email         new_col     name    home
0  pavan  20.0   121.0  sms@gmail  pavansms@gmail      NaN     NaN
1  dhoni  30.0   122.0  jfn@gmail  dhonijfn@gmail      NaN     NaN
2    NaN   NaN     NaN        NaN             NaN     thor  asgard
3    NaN   NaN     NaN        NaN             NaN     hulk     lab
4    NaN   NaN     NaN        NaN             NaN  captain     war

In [48]:
df1.append(df2, ignore_index=True, sort=False)

   first   age  aadhar      email         new_col     name    home
0  pavan  20.0   121.0  sms@gmail  pavansms@gmail      NaN     NaN
1  dhoni  30.0   122.0  jfn@gmail  dhonijfn@gmail      NaN     NaN
2    NaN   NaN     NaN        NaN             NaN     thor  asgard
3    NaN   NaN     NaN        NaN             NaN     hulk     lab
4    NaN   NaN     NaN        NaN             NaN  captain     war

In [49]:
#for making it permanent no inplace is used just assign it to the df1
df1=df1.append(df2, ignore_index=True, sort=False)

In [50]:
df1

   first   age  aadhar      email         new_col     name    home
0  pavan  20.0   121.0  sms@gmail  pavansms@gmail      NaN     NaN
1  dhoni  30.0   122.0  jfn@gmail  dhonijfn@gmail      NaN     NaN
2    NaN   NaN     NaN        NaN             NaN     thor  asgard
3    NaN   NaN     NaN        NaN             NaN     hulk     lab
4    NaN   NaN     NaN        NaN             NaN  captain     war

In [51]:
df1.drop(index =4)

   first   age  aadhar      email         new_col  name    home
0  pavan  20.0   121.0  sms@gmail  pavansms@gmail   NaN     NaN
1  dhoni  30.0   122.0  jfn@gmail  dhonijfn@gmail   NaN     NaN
2    NaN   NaN     NaN        NaN             NaN  thor  asgard
3    NaN   NaN     NaN        NaN             NaN  hulk     lab

In [53]:
#dropping base on conditional

df1.drop(index = df1[df1['name']=='hulk'].index)

   first   age  aadhar      email         new_col     name    home
0  pavan  20.0   121.0  sms@gmail  pavansms@gmail      NaN     NaN
1  dhoni  30.0   122.0  jfn@gmail  dhonijfn@gmail      NaN     NaN
2    NaN   NaN     NaN        NaN             NaN     thor  asgard
4    NaN   NaN     NaN        NaN             NaN  captain     war

In [27]:
import pandas as pd

countries = {
    
    "name":["india","usa","canada","adam"],
    "caps":["delhi","wdc","toronto","cathy"]
    

}

In [28]:

df3=pd.DataFrame(countries)

In [29]:
df3

     name     caps
0   india    delhi
1     usa      wdc
2  canada  toronto
3    adam    cathy

In [17]:
df3.sort_values(by ='caps') #sorting values using col names

     name     caps
0   india    delhi
2  canada  toronto
1     usa      wdc

In [21]:
df3.sort_values(by='caps', ascending=False)

     name     caps
1     usa      wdc
2  canada  toronto
0   india    delhi

In [22]:
#sorting multiple values

df3.sort_values(by =['name','caps'])

     name     caps
2  canada  toronto
0   india    delhi
1     usa      wdc

In [31]:
#sorting one col ascen and other descen

df3.sort_values(by=['name','caps'], ascending=[False,True], inplace= True)

In [32]:
df3

     name     caps
1     usa      wdc
0   india    delhi
2  canada  toronto
3    adam    cathy

In [33]:
df3.sort_index()

     name     caps
0   india    delhi
1     usa      wdc
2  canada  toronto
3    adam    cathy